PublicationSubscriber

<?xml version="1.0" encoding="UTF-8"?>
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <soapenv:Header>
    <fueloauth>{{accessToken}}</fueloauth>
  </soapenv:Header>
   <soapenv:Body>
    <CreateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
        <Options/>
        <Objects xsi:type="ns2:DataExtension" xmlns:ns2="http://exacttarget.com/wsdl/partnerAPI">
            <CustomerKey>PublicationSubscriber Data View</CustomerKey>
            <Name>PublicationSubscriber Data View</Name>
            <Description>Mimics the PublicationSubscriber Data View</Description>
            <IsSendable>false</IsSendable>
            <IsTestable>false</IsTestable>
            <Fields>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>PublicationID</CustomerKey>
                    <Name>PublicationID</Name>
                    <Label>PublicationID</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Number</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>ListName</CustomerKey>
                    <Name>ListName</Name>
                    <Label>ListName</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>50</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>SubscriberId</CustomerKey>
                    <Name>SubscriberId</Name>
                    <Label>SubscriberId</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Number</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>TransactionalOptIn</CustomerKey>
                    <Name>TransactionalOptIn</Name>
                    <Label>TransactionalOptIn</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Boolean</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>TransactionalOptInDate</CustomerKey>
                    <Name>TransactionalOptInDate</Name>
                    <Label>TransactionalOptInDate</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>TransactionalOptOutDate</CustomerKey>
                    <Name>TransactionalOptOutDate</Name>
                    <Label>TransactionalOptOutDate</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>MarketingOptIn</CustomerKey>
                    <Name>MarketingOptIn</Name>
                    <Label>MarketingOptIn</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Boolean</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>MarketingOptInDate</CustomerKey>
                    <Name>MarketingOptInDate</Name>
                    <Label>MarketingOptInDate</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>MarketingOptOutDate</CustomerKey>
                    <Name>MarketingOptOutDate</Name>
                    <Label>MarketingOptOutDate</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
            </Fields>
        </Objects>
    </CreateRequest>
</soapenv:Body>
</soapenv:Envelope>
